from .config import bot_name_fa
pv_AddToGroup_button = '😇 بیام گروهت ؟'
pv_MyChannel_Button = '🛎 کانال من'
pv_Help_Button = '📚 آموزش من'
pv_About_Button = '😁 درباره من'

pv_start_text = '''سلام عزیزم خوشآمدی🤗

توسط من میتونی فضای خشک و بی جون گروهت رو عوض کنی و کلی با دوستات شاد باشین 😃 

من مثل یک هوش مصنوعی برای گروهت هستم که میتونی بهم هر چی که تو ذهنته یاد بدی و من بهشون سریع جواب میدم , تازه من میتونم ویس هم یاد بگیرم 😁

حالا اگه کاری داری زود بگو برات انجام بدم 👇🏻'''


group_echo_len_none = '''دقیقا چی بگم ؟!'''
group_required_admin = '''واسه این قابلیتم باید ادمین باشم !'''
group_now_status_on = 'من از قبل روشن بودم !'
group_now_status_off = 'من از قبل خاموش بودم !'


already_existed_value = 'اینو از قبلشم بلد بودم:/'
just_text_supported_reply = 'چیزی که یاد میگیرم فقط باید متن یا ویس خالی باشه :/'
clear_all_key_text = 'هرچی که بلد بودم رو فراموش کردم !'

len_stats_fun_error = "طول کلمه درخواستی باید بین ۲ تا ۱۵ حرف باشد!"

commands_empty_error = 'هنوز چیزی یاد نگرفتم ):'

len_key_forget_error = 'دقیقا چیو باید فراموش کنم؟'
key_forget_true = 'فراموشش کردم ):'
key_forget_not_find = 'از اولشم چنین چیزی بلد نبودم'
you_are_not_admin = 'شما ادمین نیستید !'

len_valus = 'بیشتر از ۲ جواب برای هر کلمه نمیتونم یاد بگیرم'
empty_key_error = 'دقیقا باید چیو یاد بگیرم ؟!'
unicode_error = 'لطفا کلمات رو به هم نچسبون که بفهمم چی گفتی !'
status_on = 'روشن شدم'
status_off = 'خاموش شدم'


panel_gp_text = """
⚡️ به تنظیمات ربات خوش اومدی 

💡 لطفا گزینه مد نظرت رو انتخاب کن تا ببینم چطوری میتونم بهت کمک کنم
"""

group_button_commands = '📕 چیا بلدم ؟'
group_button_status_main = '« وضعیت »'
group_button_help = '📚 راهنما'
group_button_channel = '📮 کانال'
group_button_close = '📥 بستن تنظیمات'

group_help_button_learn_text  = '📄 آموزش جمله'
group_help_button_learn_voice = '🎙 آموزش ویس'
group_help_button_echo_text  = '🔂 تکرار جمله'
group_help_button_text_delete = '⛔️ حذف جمله'
group_help_button_text_delete_all = '🛑 حذف کلی'
group_help_button_fun = '👻 فان'
group_help_button_list_commands = '📖 لیست کلمات'
group_help_button_status = '🔒 خاموش/روشن'
back_button = '🔙 برگشت'
clear_commands_button = '❌ پاکسازی کلمات'
yes_clear_button = '❌ پاکسازی کن'
clear_all_commands_text = '❌ آیا شما مطمعن هستید که میخواهید تمام کلماتی که ربات یاد گرفته است را پاک کنید ؟!'

just_user_requested = 'فقط کسی که درخواست تنظیمات کرده میتواند از این بخش استفاده کند !'
close_panel_text = 'تنظیمات بسته شد !'


group_help_learn_text = f'''📚 بخش آموزش جمله 

• برای آموزش جمله به ربات دو حالت وجود دارد :

💬 حالت اول :
❗️ در یک خط همه چیز را شرح میدهیم

🔻 مثال :
{bot_name_fa} درجواب سلام بگو سلام 
{bot_name_fa} درجواب سلام بگو سلام علیکم
{bot_name_fa} درجواب خوبی بگو ممنون تو خوبی ؟
{bot_name_fa} درجواب کجایی بگو خونه نشستم

💬 حالت دوم :
❗️ با ریپلای کردن روی پیام به ربات یاد میدهیم

🔻 مثال :
{bot_name_fa} در جواب سلام بگو
{bot_name_fa} در جواب خوبی بگو
{bot_name_fa} در جواب چخبر بگو
{bot_name_fa} در جواب کجایی بگو


📍 توجه داشته باشید  اگر برای هر جمله پاسخ‌های بیشتری تنظیم کنیم ربات بهتر عمل میکند
'''

group_help_learn_voice = f'''📚 بخش آموزش ویس 

• برای آموزش ویس به ربات یک حالت وجود دارد

💬 روی ویس ریپلای کنید :
❗️ توجه داشته باشید حتما باید دستورتان را روی یک ویس ریپلای کنید

 🔻 مثال :
{bot_name_fa} در جواب سلام بگو
{bot_name_fa} در جواب سلام بگو 
{bot_name_fa} در جواب خوبی بگو 
{bot_name_fa} در جواب دلم گرفته بگو


📍 اگر برای یک جمله هم ویس هم جمله عادی تنظیم کنید ربات بصورت رندوم عمل میکند و هر بار ممکن است ویس یا متن را بفرستد
'''

group_help_echo_text = f'''📚 بخش آموزش تکرار کلمات 

• برای آموزش تکرار کلمات دو حالت وجود دارد

💬 حالت اول :
❗️ توجه داشته باشید حتما باید دستورتان را روی یک پیام ریپلای کنید

🔻 مثال :
{bot_name_fa} بگو سلام
{bot_name_fa} بگو سلام عزیزم 
{bot_name_fa} بگو خوبی صبت بخیر
{bot_name_fa} بگو مخلصم عشقم

💬 حالت دوم :
❗️ نیاز به ریپلای کردن روی پیام کسی ندارید

🔻 مثال :
{bot_name_fa} بگو سلام
{bot_name_fa} بگو سلام عزیزم 
{bot_name_fa} بگو خوبی صبت بخیر
{bot_name_fa} بگو مخلصم عشقم


📍 توجه داشته باشید که ربات باید حتماً ادمین گروه باشد و دسترسی حذف پیام داشته باشد که این قابلیت طبیعی و جذاب جلوه کند
'''

group_help_fun = f'''📚 بخش آمار فان 

• برای استفاده از این بخش یک حالت وجود دارد

💬 روی پیام کسی ریپلای کنید :
❗️ توجه داشته باشید حتما پیامتان با حرف (م) تمام شود

🔻 مثال :
{bot_name_fa} به یه ورم
{bot_name_fa} به شصتم
{bot_name_fa} به شیرم
{bot_name_fa} به ساعدم


📍 در این حالت میتوانید با شخصی که روی پیامش ریپلای کرده‌اید به صورت گروهی شوخی کنید
'''

group_help_text_delete = f'''📚 بخش حذف دستور

• برای استفاده از این بخش یک حالت وجود دارد

💬 کلمه‌ای که ربات بلد هست رو وارد کنید :
❗️ توجه داشته باشید که حتما باید ربات آن کلمه را از قبل بلد باشد

🔻 مثال :
{bot_name_fa} فراموش کن سلام
{bot_name_fa} فراموش کن خوبی
{bot_name_fa} فراموش کن چخبر
{bot_name_fa} فراموش کن داداش سلام



📍 در این حالت تمامی پاسخ‌ها برای کلمه مورد نظر پاکسازی میشود
'''

group_help_text_delete_all = f'''📚 بخش حذف کلی دستورات

• برای استفاده از این بخش یک حالت وجود دارد

💬 حذف کلی دستورات :
❗️ توجه داشته باشید که ربات تمامی چیزهایی که یاد گرفته رو فراموش میکنه

🔻 مثال :
{bot_name_fa} پاکسازی دستورات



📍 در این حالت ربات تمامی کلماتی که از اول یادش دادین رو از حافظه‌ش پاک میکنه
'''

group_help_list_commands = f'''📚 بخش لیست کلمات

• برای استفاده از این بخش یک حالت وجود دارد

💬 لیست کل کلمات :
❗️ توجه داشته باشید که ربات تمامی چیزهایی که یاد گرفته رو براتون میاره

🔻 مثال :
{bot_name_fa} لیست دستورات



📍 در این حالت ربات از اول تا الان تمامی کلماتی که یادش دادین رو براتون لیست میکنه
'''

group_help_status = f'''📚 بخش خاموش/روشن کردن 

• برای استفاده از این بخش دو حالت وجود دارد

💬 حالت اول :
❗️ توجه داشته باشید که در این حالت ربات روشن میشود و پیام ها را میخواند

🔻 مثال :
{bot_name_fa} روشن 
{bot_name_fa} روشن شو 
{bot_name_fa} روشن شو عزیز دلم
{bot_name_fa} روشن باش 


💬 حالت دوم :
❗️ توجه داشته باشید که در این حالت ربات خاموش میشود و پیام ها را نمیخواند

🔻 مثال :
{bot_name_fa} خاموش 
{bot_name_fa} خاموش شو 
{bot_name_fa} خاموش شو عزیز دلم
{bot_name_fa} خاموش باش 


📍 توجه داشته باشید با استفاده از این خالت میتوانید ربات را خاموش و روشن کنید در مواقعی که لازم است روشن باشد یا خاموش باشد
'''
help_text = f'''📮 به بخش راهنمای ربات {bot_name_fa} خوشآمدی 

• در این بخش میتونی همه قابلیت های {bot_name_fa} رو یاد بگیری

👇🏻 حالا بخشی رو که میخوای یادش بگیری انتخاب کن 👇🏻
'''





add_new_group_msg = f'''سلام من {bot_name_fa} هستم 😍

ازت ممنونم که من رو قابل دونستی و به گروه خودت اضافه کردی 🌷

❗️ من به صورت پیشفرض هیچی بلد نیستم و تو میتونی بر اساس چیزایی که خودت دوست داری من رو آموزش بدی 

📚 برای دریافت آموزش من از دستورات زیر استفاده کن :

• {bot_name_fa} آموزش
• {bot_name_fa} راهنما
• {bot_name_fa} پنل
'''


channel_sponser_text = '🛎 کانال اسپانسر'

please_join_sponser = '''❗️برای استفاده از ربات ابتدا باید در کانال اسپانسر عضو شوید 
📄 پس از عضویت دوباره درخواست خود را ارسال کنید'''


help_pv = f'''• برای استفاده از راهنمای ربات و یادگیری کامل آن کافیه که در گروهی که ربات را در آن عضو کرده‌اید یکی از دستورات زیر را وارد کنید :

» {bot_name_fa} پنل
» {bot_name_fa} راهنما
» {bot_name_fa} آموزش


❗️ توجه داشته باشید که این دستورات را فقط باید در گروه وارد کنید
'''

info_pv = f'''🎗 {bot_name_fa} یک ربات فان و‌ مخصوص گروه است که مثل یک هوش مصنوعی عمل میکنه

• هر جمله‌ای که بخواهید میتوانید به آن یاد دهید
• هر ویس و صدایی که مد نظر شماست میتوانید به آن یاد دهید

🗂 اطلاعات کلی :

Lang : Python
Lib : Hydrogram
DB : Redis & MongoDB
Author : @DeepPythonist
'''
